Revit 2027 API
ScheduleHeightsOnSheet Methods
The ScheduleHeightsOnSheet type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBodyRowHeights |  Returns each row's height of schedule body on sheet view.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace